CommonSecurityLog
| where DeviceVendor == "Fortinet"
| where DeviceProduct == "Fortigate"
| where Activity contains "vpn failure"
| summarize FailureCount = count() by SourceIP, DestinationIP, Message, DeviceAction,  bin(TimeGenerated, 5m)
| where FailureCount > 5
